app/Http/Controllers/Auth/LoginController.php

    protected function authenticated(Request $request, $user)
    {
        // $user = Auth::user();
        $branches = \App\Branch::all();
---
select * from `branches` where `branches`.`deleted_at` is null