app/Http/Controllers/HomeController.php

                        ->where('branch_id', session('branch_id'))
                        ->sum('fnb_amount');

        $today_sales_voucher = Income::with('income_category')
                        ->whereBetween('entry_date', [$today, $now])
                        ->where('income_category_id', 6)
                        ->where('branch_id', session('branch_id'))
                        ->sum('amount');

        $today_sales_voucher_no = Income::with('income_category')
                        ->whereBetween('entry_date', [$today, $now])
                        ->where('income_category_id', 6)
                        ->where('branch_id', session('branch_id'))
                        ->count();

        $today_sales_etc = Income::with('income_category')
                        ->whereBetween('entry_date', [$today, $now])
                        ->where('income_category_id', 7)
                        ->where('branch_id', session('branch_id'))
                        ->sum('amount');
---
select sum(`amount`) as aggregate from `incomes` where `entry_date` between '2017-10-03 00:00:00' and '2017-10-03 23:59:00' and `income_category_id` = '1' and `branch_id` = '1' and `incomes`.`deleted_at` is null
select count(*) as aggregate from `incomes` where `entry_date` between '2017-10-03 00:00:00' and '2017-10-03 23:59:00' and `income_category_id` = '2' and `branch_id` = '1' and `incomes`.`deleted_at` is null
select sum(`amount`) as aggregate from `incomes` where `entry_date` between '2017-10-03 00:00:00' and '2017-10-03 23:59:00' and `income_category_id` = '2' and `branch_id` = '1' and `incomes`.`deleted_at` is null


        while ($to < $now) {
            $date[$i] = $from->format('D, j-M');
            $sales_no[$i] = Income::with('income_category')
                        ->whereBetween('entry_date', [$from, $to->addHours(23)->addMinutes(59)])
                        ->where('branch_id', session('branch_id'))
                        ->count();
---
select count(*) as aggregate from `incomes` where `entry_date` between '2017-09-18 00:00:00' and '2017-09-25 00:00:00' and `branch_id` = '1' and `incomes`.`deleted_at` is null


            // $wax_no[$i]

            $wax_no_temp1 = Income::with('income_category')
                        ->whereBetween('entry_date', [$from, $to])
                        ->where('income_category_id', 2)
                        ->where('branch_id', session('branch_id'))
                        ->count();
---
select count(*) as aggregate from `incomes` where `entry_date` between '2017-09-18 00:00:00' and '2017-09-25 00:00:00' and `income_category_id` = '2' and `branch_id` = '1' and `incomes`.`deleted_at` is null