app/Http/Controllers/HomeController.php

select sum(amount + fnb_amount + wax_amount) as aggregate from `incomes` inner join `vehicles` on `vehicles`.`id` = `vehicle_id` where `entry_date` between '2017-10-16 00:00:00' and '2017-10-16 23:59:00' and `type` = 'motor' and `branch_id` = '1' and `incomes`.`deleted_at` is null
---
                        ->where('branch_id', session('branch_id'))
                        ->sum(DB::raw('IFNULL(amount,0) + IFNULL(fnb_amount,0) + IFNULL(wax_amount,0)'));

        $today_sales_dollar_motor = Income::with('income_category')
                        ->whereBetween('entry_date', [$today, $now])
                        ->join('vehicles', 'vehicles.id', '=', 'vehicle_id')
                        ->where('type','motor')
                        ->where('branch_id', session('branch_id'))
                        ->sum(DB::raw('IFNULL(amount,0) + IFNULL(fnb_amount,0) + IFNULL(wax_amount,0)'));

select count(*) as aggregate from `incomes` inner join `vehicles` on `vehicles`.`id` = `vehicle_id` where `entry_date` between '2017-10-16 00:00:00' and '2017-10-16 23:59:00' and `type` = 'motor' and `branch_id` = '1' and `incomes`.`deleted_at` is null
---
                        ->where('branch_id', session('branch_id'))
                        ->count('vehicle_id');

        $today_sales_no_motor = Income::with('income_category')
                        ->whereBetween('entry_date', [$today, $now])
                        ->join('vehicles', 'vehicles.id', '=', 'vehicle_id')
                        ->where('type','motor')
                        ->where('branch_id', session('branch_id'))
                        ->count();

select sum(amount + fnb_amount + wax_amount) as aggregate from `incomes` where `entry_date` between '2017-10-03 00:00:00' and '2017-10-03 23:59:00' and `branch_id` = '1' and `incomes`.`deleted_at` is null
---
                        ->where('branch_id', session('branch_id'))
                        ->count();

        $today_sales_fnb = Income::with('income_category')
                        ->whereBetween('entry_date', [$today, $now])
                        ->where('fnb_amount', '>', '0')
                        ->where('branch_id', session('branch_id'))
                        ->sum('fnb_amount');

select count(*) as aggregate from `incomes` inner join `vehicles` on `vehicles`.`id` = `vehicle_id` where `entry_date` between '2017-10-03 00:00:00' and '2017-10-03 23:59:00' and `type` = 'mobil' and `income_category_id` = '1' and `branch_id` = '1' and `incomes`.`deleted_at` is null
---
                        ->where('branch_id', session('branch_id'))
                        ->count();

        $today_no_fnb_motor = Income::with('income_category')
                        ->whereBetween('entry_date', [$today, $now])
                        ->join('vehicles', 'vehicles.id', '=', 'vehicle_id')
                        ->where('fnb_amount', '>', '0')
                        ->where('type', 'motor')
                        ->where('branch_id', session('branch_id'))
                        ->count();

select count(*) as aggregate from `incomes` where `entry_date` between '2017-10-03 00:00:00' and '2017-10-03 23:59:00' and `income_category_id` = '2' and `branch_id` = '1' and `incomes`.`deleted_at` is null
select sum(`amount`) as aggregate from `incomes` where `entry_date` between '2017-10-03 00:00:00' and '2017-10-03 23:59:00' and `income_category_id` = '2' and `branch_id` = '1' and `incomes`.`deleted_at` is null
---

        while ($to < $now) {
            $date[$i] = $from->format('D, j-M');
            $sales_no[$i] = Income::with('income_category')
                        ->whereBetween('entry_date', [$from, $to->addHours(23)->addMinutes(59)])
                        ->where('branch_id', session('branch_id'))
                        ->count();

            $sales_dollar[$i] = Income::with('income_category')
                        ->whereBetween('entry_date', [$from, $to])
                        ->where('branch_id', session('branch_id'))
                        ->sum(DB::raw('IFNULL(amount,0) + IFNULL(fnb_amount,0) + IFNULL(wax_amount,0)'));

select count(*) as aggregate from `incomes` where `entry_date` between '2017-10-16 07:00:00' and '2017-10-16 08:00:00' and `income_category_id` = '2' and `branch_id` = '1' and `incomes`.`deleted_at` is null
---

            // $wax_no[$i]

            $wax_no_temp1 = Income::with('income_category')
                        ->whereBetween('entry_date', [$from, $to])
                        ->where('income_category_id', 2)
                        ->where('branch_id', session('branch_id'))
                        ->count();