app/Http/Controllers/IncomesController.php

select * from `income_categories` where `income_categories`.`id` in ('1', '3', '5')
select * from `incomes` where `entry_date` between '2017-10-02 05:00:39' and '2017-10-16 09:33:39' and `branch_id` = '1' and `incomes`.`deleted_at` is null order by `entry_date` desc
select * from `vehicles` where `vehicles`.`id` in ('1', '2', '5', '6', '7', '8', '9', '10')
---
    public function index()
    {
        if (! Gate::allows('income_access')) {
            return abort(401);
        }

        $to = Carbon::now();
        $from = clone $to;
        $from->subDays(14);
        $from->hour=5;
        $from->minute=0;
        $incomes = Income::with('income_category','vehicle','payment_type')->orderBy('entry_date','desc')
                    ->whereBetween('entry_date', [$from, $to])
                    ->where('branch_id', session('branch_id'))
                    ->get();

select * from `branches` where `branches`.`deleted_at` is null
select * from `accounts` where `accounts`.`deleted_at` is null
select * from `income_categories`
select * from `products` where `products`.`deleted_at` is null
select * from `customers` where `customers`.`id` in ('1', '2', '3', '5', '6', '8', '9', '10', '11', '12', '13', '14', '16', '17', '19', '20', '21', '25', '26', '27', '28', '29', '30', '31', '33', '34', '35', '36', '37', '38', '39', '41', '42', '43', '44', '45', '46', '47', '48', '49', '50', '51', '52', '53', '54', '55', '56', '57', '62', '63', '64', '66', '69', '70', '74', '75', '76', '77', '78', '80', '81', '82', '83', '84', '85', '86', '87', '88', '89', '90', '91', '92', '93')
select * from `vehicles` where `vehicles`.`deleted_at` is null
---
    public function create()
    {
        if (! Gate::allows('income_create')) {
            return abort(401);
        }
        $minutes = 60*24;
        $minutes_fast = 60;
        $branches = Cache::remember('branches', $minutes, function () {
            return \App\Branch::get();
        });

        $payment_types = Cache::remember('payment_types', $minutes, function () {
            return \App\Account::get();
        });

        $income_categories = Cache::remember('income_categories', $minutes, function () {
            return \App\IncomeCategory::get();
        });

        $products = Cache::remember('products', $minutes, function () {
            return \App\Product::get();
        });

        // $vehicles = \App\Vehicle::with('customer')->get();
        $vehicles = Cache::remember('vehicles', $minutes, function() {
            return \App\Vehicle::with('customer')->get();
        });

select * from `customers` where `customers`.`deleted_at` is null
select * from `vehicles` where `vehicles`.`customer_id` in ('2', '3', '5', '6', '7', '8', '9', '10', '11', '12', '13', '14', '15', '16', '17', '18', '19', '20', '21', '22', '24', '25', '26', '27', '28', '29', '30', '31', '32', '33', '34', '35', '36', '37', '38', '39', '40', '41', '42', '43', '44', '45', '46', '47', '48', '49', '50', '51', '52', '53', '54', '55', '56', '57', '58', '59', '60', '61', '62', '63', '64', '66', '67', '68', '69', '70', '71', '72', '73', '74', '75', '76', '77', '78', '79', '80', '81', '82', '83', '84', '85', '86', '87', '88', '89', '90', '91', '92', '93') and `vehicles`.`deleted_at` is null order by `created_at` desc
---

        // $customers = \App\Customer::with('latestVehicle')->get();

        $customers = Cache::remember('customers', $minutes, function(){
            return \App\Customer::with('latestVehicle')->get();
        });

select * from `incomes` where `branch_id` = '1' and `incomes`.`deleted_at` is null order by `created_at` desc limit 1
---
            return [$item['id'] => $item['name'] . ': ' .$item['latestVehicle']['full_vehicle']];
        });

        $last_sales = Income::orderBy('created_at','desc')->where('branch_id', session('branch_id'))->first();

select * from `branches` where `id` = '1' and `branches`.`deleted_at` is null limit 1
---
            'income_categories' => $income_categories->pluck('name','id'),
            'products' => $products->pluck('name', 'id')->prepend('Please select', ''),
            'payment_types' => $payment_types->pluck('name', 'id'),
            'last_bon' => \App\Branch::where('id', session('branch_id'))->first()->last_bon,

insert into `incomes` (`income_category_id`, `branch_id`, `vehicle_id`, `entry_date`, `payment_type_id`, `amount`, `nobon`, `note`, `fnb_amount`, `wax_amount`, `updated_at`, `created_at`) values ('3', '1', '8', '2017-10-16 09:21', '1', '750000', '107', '', '6000', '', '2017-10-16 09:21:46', '2017-10-16 09:21:46')
select * from `branches` where `branches`.`id` = '1' and `branches`.`deleted_at` is null limit 1
update `branches` set `updated_at` = '2017-10-16 09:21:46', `last_bon` = '107' where `id` = '1'
---
    public function store(StoreIncomesRequest $request)
    {
        if (! Gate::allows('income_create')) {
            return abort(401);
        }
        // dd($request->all());
        $income = Income::create($request->all());

        //update last_bon used
        $branch = \App\Branch::findOrFail(session('branch_id'));
        $branch->update(['last_bon' => $request->nobon]);