app/Http/Controllers/MonthlyReportsController.php

    public function index(Request $r)
    {
        $from    = Carbon::parse(sprintf(
            '%s-%s-01',
            $r->query('y', Carbon::now()->year),
            $r->query('m', Carbon::now()->month)
        ));
        $to      = clone $from;
        $to->day = $to->daysInMonth;

        $exp_q = Expense::with('expense_category')
            ->whereBetween('entry_date', [$from, $to])
            ->where('branch_id', session('branch_id'));

        $inc_q = Income::with('income_category')
            ->whereBetween('entry_date', [$from, $to])
            ->where('branch_id', session('branch_id'));

        $exp_total = $exp_q->sum('amount');
        $inc_total = $inc_q->sum('amount');
        $exp_group = $exp_q->orderBy('amount', 'desc')->get()->groupBy('expense_category_id');
        $inc_group = $inc_q->orderBy('amount', 'desc')->get()->groupBy('income_category_id');
---
select * from `expenses` where `entry_date` between '2017-10-01 00:00:00' and '2017-11-01 00:00:00' and `branch_id` = '1' and `expenses`.`deleted_at` is null order by `amount` desc
select sum(`amount`) as aggregate from `expenses` where `entry_date` between '2017-10-01 00:00:00' and '2017-11-01 00:00:00' and `branch_id` = '1' and `expenses`.`deleted_at` is null
select * from `income_categories` where `income_categories`.`id` in ('1', '3', '5')
select * from `incomes` where `entry_date` between '2017-10-01 00:00:00' and '2017-11-01 00:00:00' and `branch_id` = '1' and `incomes`.`deleted_at` is null order by `amount` desc
select sum(`amount`) as aggregate from `incomes` where `entry_date` between '2017-10-01 00:00:00' and '2017-11-01 00:00:00' and `branch_id` = '1' and `incomes`.`deleted_at` is null

            }
        }

        $inc_categories = IncomeCategory::all();

        $inc_detail = [];
        foreach ($inc_categories as $cat) {
            $inc_detail[$cat->name] = [
                'sales'     => Income::with('income_category')
                                ->whereBetween('entry_date', [$from, $to])
                                ->where('branch_id', session('branch_id'))
                                ->where('income_category_id', $cat->id)
                                ->count()
                                ,
                'vehicles'  => Income::with('income_category')
                                ->whereBetween('entry_date', [$from, $to])
                                ->where('branch_id', session('branch_id'))
                                ->where('income_category_id', $cat->id)
                                ->groupBy('vehicle_id')
                                ->count()
                ];
---
select * from `income_categories`
select count(distinct `vehicle_id`) as aggregate from `incomes` where `entry_date` between '2017-10-01 00:00:00' and '2017-11-01 00:00:00' and `branch_id` = '1' and `income_category_id` = '1' and `incomes`.`deleted_at` is null
select count(*) as aggregate from `incomes` where `entry_date` between '2017-10-01 00:00:00' and '2017-11-01 00:00:00' and `branch_id` = '1' and `income_category_id` = '1' and `incomes`.`deleted_at` is null

                        ->where('branch_id', session('branch_id'))
                        ->count();

        $no_of_vehicles = Income::with('income_category')
                        ->whereBetween('entry_date', [$from, $to])
                        ->where('branch_id', session('branch_id'))
                        ->groupBy('vehicle_id')
                        ->count();
---
select count(distinct `vehicle_id`) as aggregate from `incomes` where `entry_date` between '2017-10-01 00:00:00' and '2017-11-01 00:00:00' and `branch_id` = '1' and `incomes`.`deleted_at` is null